{"pages":[{"title":"categories","text":"","link":"/categories/index.html"},{"title":"about","text":"","link":"/about/index.html"},{"title":"tags","text":"","link":"/tags/index.html"},{"title":"contact","text":"","link":"/contact/index.html"},{"title":"friends","text":"","link":"/friends/index.html"}],"posts":[{"title":"First Blog","text":"Hello World. 2020年2月18日，我的Github博客诞生啦。虽然我还不知道以后我会写一些什么东西上去，但是总觉得这是一件特别有意思的事情。配置起来所有的东西，其实不是很难。在这里要感谢韦阳大神的文章： https://zhuanlan.zhihu.com/p/35668237以后想先多摸索下基础功能，如果用的频繁起来了，就考虑买个自己的域名儿。目前使用的编辑器为VS Code， 参考的使用方法来自于这篇文章： https://www.cnblogs.com/shawWey/p/8931697.html 这里先小小备份下几个常用的hexo 指令：hexo new post “titleofpost” 写新文章hexo g 生成静态网页hexo s 生成本地预览效果hexo d 上传到github上面 1System.out.println(&quot;Test Markdown&quot;);","link":"/2020/02/18/First-Blog/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/02/18/hello-world/"},{"title":"What to do during self-isolation","text":"转眼之间，今天已经是我自我隔离的第11天了。用我朋友的话来说：这叫居家看守所。我觉得有那么点儿意思。从我回家那会儿算起，我到今天已经有近25天没有正儿八经的出过门儿。回家那天正是年前二十八，河南小县城上还不见人戴口罩。那两天钟南山去了武汉，街上呼啦一下就没人了，用我爸的话说：那就跟净街了一样。腊月二十九的时候，我是先跟兔子见了面，然后晚上说去吃饭。结果那天我县就发现了疑似病例，我俩直接回我家看电影了，看的是《决战中途岛》，别说还是挺有意思的一个电影。但也是打那天起，我就没咋出过门儿。那么问题来了，这么多天我是怎么打发时间的，有几件事情值得说一下： 学习Java来自Britain的培根子曾经说过：知识是第一生产力–来自《武林外传》之所以要把这个列到第一位，因为我真的花了一段时间在这上面。一方面是为了下学期的课程做准备，另一方面也是为了以后的工作着想。我第一次学习Java的时候是在2017年的下半年，那是我第二次来澳洲，也是我第一次接触编程语言。如果想知道我感觉怎么样，这么说吧，我前段整理自己的Chrome书签，里面有一个天涯的帖子叫做：有没有国外读书退学的来聊一聊？ 可想而知有多难。DrJava简直是噩梦一样，跟写字本差不多。我想老师是想告诉我们梅花香自苦寒来吧，但是那真的给我带来了一个特别糟糕的体验，以至于很长一段时间我都把Java当做我最不喜欢的语言之一。直到无意间点进 翁恺 老师的Java课程，才会觉得原来老师教的好很重要，而且自己也不再经常怀疑自己，与其怀疑，不如尝试么。虽然现在学的还是很简单和肤浅的东西，但是我还是觉得很有意思的，应该会越学越有趣。 看剧和电影这个放第二，因为实在是太闲了。尤其是在家的时候，天天大电视在那儿，吃完就嗑瓜子。我们一家四口人磕了快有10斤瓜子吧整个春节。说俩我喜欢的剧吧。在家看《武林外传》比较多，经典剧目，轻松搞笑，随看随关不粘人，特别好。《毒枭：墨西哥》第二季，这一季相对来说没有这么惊艳。菲利斯在里面实在太憋屈了，感觉是个曹操，可合伙人都是棒槌，枭雄不成，入狱结尾，可惜可惜，看后面古斯曼的崛起吧。《性教育》第二季，一如既往的Cool和大尺寸，我一度还在想这些演员们是不是真的未成年。里面各种正经八百的聊一些羞羞的事情，有意思。电影就没啥了《囧妈》 烂，没啥好说的《半个喜剧》 剧情硬伤，梗老，也烂。《决战中途岛》 不错。 运动虽然我妈对我的体重增加意见不大，但是我不太愿意太早有个肚子。加入了Keep上面的老年训练计划，动动胳膊伸伸腿啥的，既不增肌也不有氧，充其量微汗。在澳洲这里我住的房子有一面水泥墙，我正好带来的有乒乓球拍和球，玩儿的不亦乐乎。哈哈 上网灌水东看看西看看，我来澳洲第三天开始才改为每天只看两次新冠疫情，我不是故意逃离这个话题。只是不想让它在我生活中占太大的比重。还是考虑下以后的事情比较好。 杂事儿比如给自己弄了个博客，纯兴趣类型的。好玩儿的很，哈哈。 就先说这么多吧。","link":"/2020/02/19/What-to-do-during-self-isolation/"}],"tags":[{"name":"自我隔离","slug":"自我隔离","link":"/tags/%E8%87%AA%E6%88%91%E9%9A%94%E7%A6%BB/"}],"categories":[{"name":"随笔","slug":"随笔","link":"/categories/%E9%9A%8F%E7%AC%94/"}]}